Revit 2027 API
DocumentChangedEventArgs.GetTransactionNames Method
 Returns names of the transactions associated with this event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetTransactionNames()
Public Function GetTransactionNames As IList(Of String)
public:
IList<String^>^ GetTransactionNames()
member GetTransactionNames : unit -> IList<string>
Return Value
IList<String>
 The names of the transactions associated with this event
Remarks
 Typically, there will be only one name in the array, because document changes mostly involve just one transaction
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace